## Staging: system_status
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                           NAME                                           |
|--------|------------------------------------------------------------------------------------------|
| add    | `module.system_status.aws_iam_policy.vpc_policies[0]`                                    |
|        | `module.system_status.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0]` |
|        | `module.system_status.aws_iam_role_policy_attachment.vpc_policies[0]`                    |
| delete | `module.system_status.aws_iam_policy.non_vpc_policies[0]`                                |
|        | `module.system_status.aws_iam_role_policy_attachment.non_vpc_policies[0]`                |
| update | `module.system_status.aws_lambda_function.this`                                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.system_status.aws_iam_policy.non_vpc_policies[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_iam_policy" "non_vpc_policies" {
      - arn       = "arn:aws:iam::239043911459:policy/system_status_non_vpc" -> null
      - id        = "arn:aws:iam::239043911459:policy/system_status_non_vpc" -> null
      - name      = "system_status_non_vpc" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "CloudWatchAccess"
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForlayer",
                          - "ecr:BatchGetImage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/system_status"
                      - Sid      = "ECRImageAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPATPKBAT4R46WSICEFE" -> null
      - tags      = {
          - "CostCentre" = "notification-canada-ca-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all  = {
          - "CostCentre" = "notification-canada-ca-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # module.system_status.aws_iam_policy.vpc_policies[0] will be created
  + resource "aws_iam_policy" "vpc_policies" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "system_status_vpc"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/system_status"
                      + Sid      = "ECRImageAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
    }

  # module.system_status.aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole[0] will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "system_status"
    }

  # module.system_status.aws_iam_role_policy_attachment.non_vpc_policies[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_iam_role_policy_attachment" "non_vpc_policies" {
      - id         = "system_status-20231212143525547100000002" -> null
      - policy_arn = "arn:aws:iam::239043911459:policy/system_status_non_vpc" -> null
      - role       = "system_status" -> null
    }

  # module.system_status.aws_iam_role_policy_attachment.vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "system_status"
    }

  # module.system_status.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "system_status"
        tags                           = {
            "CostCentre" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "sqlalchemy_database_reader_uri" = (sensitive value)
                # (2 unchanged elements hidden)
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0e2c3ef6c5c75b74c",
            ]
          + subnet_ids                  = [
              + "subnet-001e585d12cce4d1e",
              + "subnet-08de34a9e1a7458dc",
              + "subnet-0af8b8402f1d605ff",
            ]
        }

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.system_status_testing[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.system_status_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-system_status-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-system_status-api[0]"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
